{
    "places": [
      {
        "id": "ChIJURDKN2eAhYARN0AMzUEaiKo",
        "types": [
          "seafood_restaurant",
          "restaurant",
          "food",
          "point_of_interest",
          "establishment"
        ],
        "formattedAddress": "PIER 1 1/2 The Embarcadero N, San Francisco, CA 94111, USA",
        "location": {
          "latitude": 37.7971645,
          "longitude": -122.3953359
        },
        "rating": 4.5,
        "googleMapsUri": "https://maps.google.com/?cid=12288100453195726903",
        "userRatingCount": 4153,
        "displayName": {
          "text": "La Mar Cocina Peruana",
          "languageCode": "en"
        },
        "primaryTypeDisplayName": {
          "text": "Restaurant",
          "languageCode": "en-US"
        },
        "primaryType": "restaurant",
        "shortFormattedAddress": "PIER 1 1/2 The Embarcadero N, San Francisco",
        "editorialSummary": {
          "text": "Celeb chef Gastón Acurio serves Peruvian seafood in a large, partially outdoor space on the pier.",
          "languageCode": "en"
        },
        "reviews": [
          {
            "relativePublishTimeDescription": "3 weeks ago",
            "rating": 5,
            "text": {
              "text": "What a great place! Did an early dinner during a layover in San Francisco and we were so happy we stumbled into this restaurant. Food was absolutely excellent, the recommendations from our server were top notch. Service was excellent and the cocktails were just as good. You wont be disappointed eating here!",
              "languageCode": "en"
            }
          },
          {
            "relativePublishTimeDescription": "3 weeks ago",
            "rating": 5,
            "text": {
              "text": "This is my favorite restaurant in San Francisco.  We have dined there many times and have always experienced a perfect meal and great connective service.\nWe go here every time we are in SF, and this time, we dined there 3 times.  Yes, that good!\nEmpanadas are a must.\nOctopus is a definite!\nEverything else is amazing.  Best Peruvian restaurant I have experienced.",
              "languageCode": "en"
            }
          },
          {
            "relativePublishTimeDescription": "in the last week",
            "rating": 5,
            "text": {
              "text": "One of my favorite restaurants on San Francisco's Embarcadero. We came here to celebrate a birthday and every dish our party of five ordered was delicious!\n\nParking can get tricky, but we went right when it opened on a Sunday and found parking close by.",
              "languageCode": "en"
            }
          },
          {
            "relativePublishTimeDescription": "4 months ago",
            "rating": 5,
            "text": {
              "text": "The food here is excellent and has really flavorful options even for those with dietary restrictions. Very refreshing cocktails - definitely can’t skip one here as they are all so delicious! Service can be a bit lacking during weekend peak hours… make sure you get your entire order in at once as it’s hard to get their attention. The space is huge with lot of seating, and the outdoor seating has beautiful views of the bay so definitely make reservations in advance if you’d like the best tables!",
              "languageCode": "en"
            }
          },
          {
            "relativePublishTimeDescription": "a week ago",
            "rating": 4,
            "text": {
              "text": "This meal was absurd. One of the best meals of my life. Ironically, the best thing served was the taro chips - we kept on reordering them. Highly recommend the ceviche taster, gave a good portion to share of each.",
              "languageCode": "en"
            }
          }
        ],
        "generativeSummary": {
          "overview": {
            "text": "Expansive, waterfront Peruvian restaurant serving ceviche and other seafood dishes, plus cocktails.",
            "languageCode": "en-US"
          },
          "description": {
            "text": "Upscale Peruvian eatery set on Pier 1 1/2 in the Embarcadero neighborhood with bay views.\nThe large venue features a bar and outdoor seating on the waterfront patio. It's popular for lunch and dinner, and reservations are recommended. People say the staff is attentive.\nThe menu focuses on seafood. Popular dishes include empanadas, ceviche, and lomo saltado. Guests also like the pisco sours and the desserts.\nVisitors praise the location, the atmosphere, and the views.\nCustomers typically spend $50–100.",
            "languageCode": "en-US"
          }
        }
      }
    ]
  }
  